backend/tests/performance/load-test.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Warm up"
    - duration: 60
      arrivalRate: 15
      name: "Ramp up"
    - duration: 60
      arrivalRate: 30
      name: "Sustained load"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Browse routes"
    weight: 40
    flow:
      - get:
          url: "/api/routes"
      - get:
          url: "/api/routes?difficulty=easy&page=1&limit=10"
      - get:
          url: "/api/routes?sort=averageRating&order=desc"

  - name: "Auth flow"
    weight: 20
    flow:
      - post:
          url: "/api/auth/register"
          json:
            firstName: "Load"
            lastName: "Tester_{{ $randomNumber() }}"
            email: "load_{{ $uuid }}@test.com"
            password: "LoadTest123"
          capture:
            - json: "$.data.accessToken"
              as: "token"
      - get:
          url: "/api/auth/me"
          headers:
            Authorization: "Bearer {{ token }}"

  - name: "View route details"
    weight: 30
    flow:
      - get:
          url: "/api/routes?limit=1"
          capture:
            - json: "$.data.items[0]._id"
              as: "routeId"
      - get:
          url: "/api/routes/{{ routeId }}"
          ifTrue: "routeId"
      - get:
          url: "/api/reviews?route={{ routeId }}"
          ifTrue: "routeId"

  - name: "Health check"
    weight: 10
    flow:
      - get:
          url: "/health"